NONE
mountain,mountains
ski,skis,skiing,skier
skier,skiers
dog,dogs
tail,tailed,tails
wag,wagging,wags
canoe,canoes
lake,lakes
paddle,paddling,paddles,paddled
pull,pulls,pulling,pulled
station,stations,stationed
train,trains,trained,training
eat,eating,eats,ate,eaten
hay
horse,horses
fan,fans
match,matches,matching,matched
watch,watches,watching,watched
surround,surrounded,surrounding,surrounds
lay,laying,laid,lays,layed,lying
rug,rugs
hang,hanging,hung,hangs,hanged
painting,paintings
wall,walls,walled
carry,carries,carrying,carried
food,foods
tray,trays
stadium,stadiums
cat,cats
lick,licks,licking
paw,paws,pawing
room,rooms
tile,tiled,tiles
shore,shores
way,ways
boat,boats
drive,driving,driven,drives,drove
grass,grasses
come,coming,comes,came
track,tracks,tracking
move,moving,moves,moved
leave,leaves,leaving,left
passenger,passengers
arrive,arrives,arriving,arrived
sit,sits,sitting,sat
wagon,wagons
stop,stopped,stopping,stops
plane,planes
runway,runways
cloud,clouds
fly,flying,flies,flew,flown,flys
herd,herds,herding,herded
sheep,sheeps
beach,beaches,beached
float,floating,floats,floated
sky,skies,skying
elephant,elephants
family,families
spend,spending,spent,spends
time,times
bathroom,bathrooms
light,lights,lit,lighted,lighting
shine,shines,shining,shined,shone
window,windows
enter,enters,entering,entered
building,buildings
feed,feeding,feeds,fed
giraffe,giraffes
zoo
lie,lay,lying,lies,lied
cob
corn
computer,computers
student,students
work,works,working,worked
airport,airports
luggage
wait,waiting,waits,waited
bridge,bridges
pass,passes,passing,passed
ship,ships
bouquet,bouquets
bride,brides,bridesmaid
flower,flowers,flowering,flowered
cake,cakes
couple,couples
stand,stands,standing,stood
stare,staring,stares,stared
hospital,hospitals
nurse,nurses,nursing
patient,patients
blanket,blanketing,blanketed,blankets
farmer,farmers
field,fields
plow,plows,plowing,plowed
head,headed,heading,heads
slope,slopes,sloped
daughter,daughters
mother,mothers
smile,smiling,smiles,smiled
friend,friends
gather,gathered,gathering,gathers
meal,meals
share,sharing,shared,shares
table,tables
construction,constructions
crane,cranes,craning
bow,bows,bowing,bowed
ribbon,ribbons
tie,tied,tying,ties
park,parked,parking,parks
picnic
reflect,reflected,reflecting,reflects
sunlight
water,waters,watering,watered
clock,clocks
ceiling,ceilings
bone,bones
chew,chews,chewing
descend,descended,descending,descends
bowl,bowls,bowled,bowling
salad,salads
vegetable,vegetables
bed,beds
pillow,pillows
sleep,sleeping,sleeps,slept
pasture,pastures
collect,collecting,collected,collects
shell,shells
board,boarded,boarding,boards
flight,flights
surface,surfaces
bench,benches
shade,shades,shaded,shading
tree,trees
post,posts,posting,posted
pigeon,pigeons
car,cars
skate,skating,skates,skated,skater
skateboarder,skateboarders
carpet,carpets,carpeted
furniture
carrot,carrots
rabbit,rabbits
boxer,boxers
fight,fighting,fights,fought
ring,rings,ringing,ringed
street,streets
seagull,seagulls
rain,rains,raining
bake,baked,baking,bakes
bread,breads,breading,breaded
oven,ovens
cheese,cheeses
pizza,pizzas
hill,hills
walk,walking,walks,walked
overlook,overlooking,overlooks,overlooked
book,books
shelf,shelves,shelfs
dive,dives,diving
diver,divers
put,putting,puts
grab,grabs,grabbing,grabbed
hand,hands,handed,handing
reach,reaches,reaching,reached
rail,rails,railing
subway
lady,ladies
color,colors,coloring,colored
die,dying,dies,died
hair,hairs
tunnel,tunnels
trough
pier,piers
library,libraries
section,sections
separate,separates,separating,separated
poke,pokes,poking,poked
ground,grounded,grounds
leg,legs
airplane,airplanes
moon,moons
lead,leads,leading,led
road,roads
day,days
push,pushing,pushed,pushes
wheelchair
towel,towels
run,running,runs,ran
fishing
apple,apples
look,looking,looked,looks
mouse
mouth,mouths,mouthing
fall,fell,falling,fallen,falls
skateboard,skateboards,skateboarding
care,cared
take,taking,takes,taken,took
shower,showers
barber
give,giving,gives,given,gave
haircut
box,boxes,boxing,boxed
fill,filled,filling,fills
highway,highways
speed,speeding,speeds,sped
dock,docked,docks,docking
find,found,finding,finds
map,maps
screen,screens,screened,screening
snowboard,snowboarding,snowboards
add,adding,added,adds
topping,toppings
market,markets
produce,produced,producing,produces
shop,shopping,shops
counter,counters
restaurant,restaurants
perform,performing,performed,performs
yoga
audience,audiences
band,bands,banded
concert
employee,employees
ball,balls
bar,bars
climb,climbing,climbs,climbed
playground
mirror,mirrors,mirrored,mirroring
reflection,reflections
sugar,sugars
grind,grinding,grinds
traveler,travelers
yard,yards
camel,camels
giraffes
middle
plate,plates,plated
meat,meats
chair,chairs,chaired,chairing
couch,couches
umbrella,umbrellas
graze,grazing,grazes,grazed
top,topped,topping,tops
toilet,toilets
piece,pieces
lot,lots
motorcycle,motorcycles
player,players
cross,crossing,crosses,crossed
react,reacts,reacting,reacted
sauce,sauces
tarmac,tarmacs
model,models,modeled,modeling
sun,sunning,suns
keyboard,keyboards
type,typing,types
tub,tubs
city,cities
travel,traveling,travelling,travels,travelled,traveled
flock,flocks
garden,gardens,gardening
grow,grown,growing,grew,grows
fireplace,fireplaces
tower,towers,towering
decorate,decorated,decorating,decorates
fish,fishes,fishing
sale,sales
front,fronts
coffee
cup,cups
donut,donuts
cattle
study,studying,studies,studied
meadow,meadows
countryside
generate,generated,generates,generating
image,images,imaged
port,ports
rise,rising,rises,risen,rose
athlete,athletes
medal,medals
win,won,wins,winning
singer,singers
celebrate,celebrating,celebrates,celebrated
holiday,holidays
formation,formations
jet,jets
bathtub
campus
banana,bananas
suitcase,suitcases
mushroom,mushrooms
moor,moored,mooring
bloom,blooming,bloomed,blooms
home,homes
forest,forests,forested
doughnut,doughnuts
bunch
depart,departs,departing,departed
bath,baths,bathing
fisherman,fishermen
net,nets
floor,floors
hiker,hikers
trail,trails,trailing
marina
bale,bales
fire,fires,firing,fired
fireman,firemen
zebra,zebras
sofa,sofas
cabinet,cabinets
engine,engines
eagle,eagles
perch,perched,perching,perches
sea,seas
land,lands,landed,landing
saucer,saucers
raise,raises,raised,raising
trunk,trunks
flow,flows,flowing,flowed
waterfall,waterfalls
bedroom,bedrooms
isle
ride,riding,rides,ridden,rode
fungus,fungi
heart,hearts
shape,shaped,shapes,shaping
jungle,jungles
pastry,pastries
fun
anchor,anchored,anchoring,anchors
lose,lost,loses,losing
abandon,abandoned
church,churches
harbor
batter,battered
catcher
pitch,pitched,pitching,pitches
change,changes,changed,changing
oil,oils
firefighter,firefighters
scene,scenes
noodle,noodles
buy,buying,buys,bought
rose,roses
vase,vases
taxi,taxiing,taxis
plain,plains
school,schools
teacher,teachers
tourist,tourists
laptop,laptops
space,spaces
gate,gates,gated
basket,baskets
mount,mounted,mounting
television,televisions
steak,steaks
crawl,crawling,crawls,crawled
toy,toys
serve,serving,served,serves
race,racing,races,raced
goat,goats
dish,dishes,dishing
lamb,lambs
star,stars,starring,starred
telescope,telescopes
live,living,lives,lived
hug,hugs,hugging,hugged
dough
spread,spreading,spreads
shirt,shirts,t-shirt
burn,burning,burns,burnt,burned
grill,grilled,grilling,grills
pilot,pilots
pot,pots
bay,bays
chimney,chimneys
smoke,smoking,smokes,smoked
loaf,loaves
rainbow,rainbows
traffic
begin,began,begun,begins,beginning
ceremony,ceremonies
feature,features,featured,featuring
cover,covers,covering,covered
portrait,portraits
shepherd,shepherds
doctor,doctors
patio,patios
father
hold,holding,held,holds
savannah
canal,canals
decor
cargo
load,loading,loaded,loads
cliff,cliffs
climber,climbers
scale,scales,scaling,scaled
porch,porches
rock,rocking,rocks,rocked
note,notes
soldier,soldiers
vehicle,vehicles
repair,repairing,repaired,repairs
roof,roofs
worker,workers
style,styles,styling,styled
barn,barns
pool,pools
yacht,yachts
moss,mosses
buggy
yarn
surfboard,surfboards
hillside,hillsides
row,rows,rowing
lean,leans,leaning,leaned
racer,racers
turn,turning,turns,turned
snow,snowed
smell,smelling,smells
item,items
wing,wings,winged
bear,bears,born,bearing
balcony,balconies
pond,ponds
swan,swans
swim,swimming,swims
accident
damage,damaged
create,created,creating,creates
pair,paired,pairs,pairing
art,arts
curve,curved,curving
crowd,crowds,crowded
entertain,entertaining,entertains,entertained
musician,musicians
glass,glasses
stain,stained
connect,connecting,connected,connects
dip,dips,dipped,dipping
toe,toes
distance
aircraft,aircrafts
vanity,vanities
museum,museums
paint,painted,paints,painting
salmon
face,facing,faced,faces
opponent,opponents
tackle,tackling,tackled,tackles
billow,billows,billowing
entrance,entrances
guard,guarding,guarded,guards
chef,chefs
cook,cooks,cooking,cooked
soar,soaring,soars
build,built,building,builds
structure,structures
farm,farms,farmed
intersection
pedestrian,pedestrians
harvest,harvesting,harvests,harvested
splash,splashes,splashing,splashed
wave,waves,waving,waved
bell,bells
breakfast
extend,extending,extended,extends
hat,hats
talk,talking,talks,talked
cyclist,cyclists
crop,crops,cropped
instrument,instruments
singe,singing,singed,singes,sings
stage,staging,stages,staged
rest,rests,resting,rested
grape,grapes
vine,vines
vineyard,vineyards
block,blocking,blocks,blocked
drink,drinks,drinking,drank
party,parties
operate,operating,operates,operated
surgeon,surgeons
exam,exams
shed,sheds
fold,folding,folded,folds
dress,dressed,dresses,dressing
shelter,sheltering,shelters,sheltered
include,including,includes,included
game,games
glide,glides,gliding
brother,brothers
sister,sisters
propeller,propellers
round,rounding,rounds
measure,measuring,measured
liberty
statue,statues
branch,branches
country,countries
snowboarder,snowboarders
grassland,grasslands
chalkboard,chalkboards
equation,equations
write,writing,written,wrote,writes
island,islands
flooring
hangar
pattern,patterns,patterned
croissant,croissants
mend,mends,mending
search,searching,searches,searched
team,teams
warm,warms,warmed,warming
railroad
clown,clowns
supermarket,supermarkets
trolley,trolleys
bike,bikes,biking
control,controls,controlled,controlling
balloon,balloons
rider,riders
arm,arms
deck,decks,decked
darken,darkening,darkens,darkened
sunflower,sunflowers
explore,explores,exploring,explored
reef,reefs
hole,holes
habitat,habitats
butter
pancake,pancakes,pancaked
syrup
air,airing
coach,coaches,coaching
member,members
mechanic
circus
cheer,cheering,cheers,cheered
bag,bags,bagging
exhibit,exhibits,exhibiting,exhibited
olive,olives
curtain,curtains
eyebrow,eyebrows
check,checks,checking,checked
chicken,chickens
tomato,tomatoes,tomatos
camp,camping,camped
tent,tents
spoon,spoons
learn,learning,learnt,learned,learns
pipe,pipes,piping
fix,fixes,fixing,fixed
toddler,toddlers
mass
priest,priests
prepare,preparing,prepares,prepared
skyscraper,skyscrapers
tank,tanks
bull,bulls
matador,matadors
illuminate,illuminated,illuminates,illuminating
lamp,lamps
bee,bees
hover,hovering,hovered,hovers
event,events
cool,cooling,cooled,cools
rack,racks
egg,eggs
jump,jumps,jumping,jumped,jumper
parachute,parachutes
lion,lions
town,towns
hamburger,hamburgers
potato,potatoes
stack,stacked,stacks,stacking
deer,deers
thing,things
classroom,classrooms
takeoff
cage,cages,caged
lock,locked,locks,locking
point,pointing,points,pointed
exit,exiting,exits,exited
magazine,magazines
stream,streams,streaming,streamed
disembark,disembarking,disembarks,disembarked
collie,collies
apartment,apartments
dining
bend,bent,bends,bending
cereal,cereals
fruit,fruits
shot,shots
eye,eyes
protect,protecting,protected,protects
sunglass,sunglasses
pour,pouring,poured,pours
terminal,terminals
visit,visiting,visited,visits
goodbye
say,saying,says,said
pen,pens
appear,appeared,appears,appearing
ear,ears
clothe,clothes,clothed
railway,railways
frame,frames,framed,framing
parent,parents
moment,moments
observe,observing,observes,observed
silence
pear,pears
oxen
gondola,gondolas
break,broke,broken,breaking,breaks
corner
think,thinking,thought,thinks
cookie,cookies
mash,mashed
cucumber,cucumbers
roll,rolling,rolls,rolled
snowball,snowballs
snowman
nature
hide,hiding,hidden,hides,hid
practice,practicing,practices
assist,assists,assisting,assisted
diaper
fountain,fountains
shoot,shooting,shot,shoots
courtyard
chocolate,chocolates
desk,desks
body,bodies
part,parts,parting,parted
tattoo,tattoos,tattooed
van,vans
bolt,bolts
tighten,tightening
bank,banks
strawberry,strawberries,strawberrys
waffle,waffles
spill,spilling,spilled,spills
gear,gears
ascend,ascending,ascends,ascended
letter,letters,lettering
spell,spelled,spelling,spells
word,words
gold,golds
trek,trekking,treks
let,letting,lets
love,loved,loving,loves
side,sides,siding
ingredient,ingredients
trailer,trailers
morning,mornings
read,reads,reading
pray,praying,prays
joy
use,uses,used,using
chandelier,chandeliers
base,based
bite,biting,bites,bitten
interior,interiors
package,packages
keep,keeping,keeps,kept
chairlift
savanna
golfer,golfers
green,greens
crust,crusts
approach,approaches,approaching,approached
bacon
arrangement,arrangements
cut,cutting,cuts
punch,punches,punched,punching
throw,throws,throwing,thrown,threw
test,tested,testing,tests
cub,cubs
variety,varieties
layer,layers,layered,layering
cushion,cushions
monk,monks
temple,temples
tend,tends,tending,tended
range,ranges
tide,tides
infant,infants
wrap,wrapped,wrapping,wraps,wraped
wood,woods
blackboard
rescue,rescued,rescues,rescuing
help,helps,helped,helping
tutor
place,places,placed,placing
flame,flames,flaming
grocery,groceries
landing,landings
resort
tube,tubes
tone,tones
mix,mixed,mixing,mixes
discuss,discussing,discusses,discussed
square,squares
scatter,scattered
direction,directions
steer,steers,steering,steered
halloween
fixture,fixtures
seat,seated,seating,seats
crib
slide,sliding,slides,slid
karaoke
airfield
helicopter,helicopters
stripe,striped,stripes,stripping
relax,relaxing,relaxes,relaxed
aim,aims,aiming,aimed
billiard,billiards
grazing
soup,soups
curb
calf,calves
vet,vets
chat,chatting,chats,chatted
homework
container,containers
customer,customers
lunch
retrieve,retrieving,retrieves
stick,stuck,sticks,sticking,stunt
neighborhood,neighborhoods
return,returns,returning,returned
volley
motorcyclist,motorcyclists
kid,kids
beekeeper,beekeepers
steeple,steeples
sidewalk
volcano
pet,pets,petting,petted
foal,foals
pastor
sermon
hike,hiking,hikes,hiked
cupcake,cupcakes
guitar,guitars
suit,suits
mall
guest,guests
plan,plans,planned,planning
wedding,weddings
storm,storms
windowsill
alcohol
gun,guns
foundation,foundations
protester,protesters
choir
conductor
procession
end,ends,ending,ended
conduct,conducts,conducting,conducted
experiment,experiments,experimenting,experimented
lab
seating
dad,dads
evening,evenings
castle,castles
tiger,tigers
injure,injured,injuring
orchestra
owl,owls
court,courts
tennis
mozzarella
tour,tours,touring
knit,kniting,knitting,knitted,knits
sweater,sweaters
fry,fries,frying,fried
aquarium,aquariums
lend,lends
everything
need,needs,needed,needing
listen,listens,listening,listened
stethoscope
cocktail,cocktails
dusk
course,courses
emergency
respond,responding,responded,responds
festival,festivals
firework,fireworks
gift,gifts
parking
pay,paid,pays,paying
arrival,arrivals
await,awaiting,awaits
diner,diners
waiter,waiters
peak,peaks,peaking
valley,valleys
outfit,outfits
ranch
skewer,skewers
battle,battling,battles,battled
yogurt
pavement
bookshelf,bookshelves
pretend,pretending,pretends
racket,rackets
dark
catch,caught,catching,catches
shark,sharks
hive,hives
honey
call,called,calls,calling
open,opening,opens,opened
research
loading
trap,trapped,traps
flashlight,flashlights
music
studio
kill,killed,kills,killing
kayak,kayaks,kayaking
tow,towing,towed,tows
coast
wash,washing,washed,washes
cast,casting,casts
rod,rods
angel,angels
burger,burgers
ketchup
toss,tosses,tossing,tossed
foot,feet,footed
football
replace,replacing,replaces,replaced
basin
coin,coins
gallop,galloping
oatmeal
fighter,fighters
surf,surfing,surfs
web
jacket
teach,teaching,teaches,taught
soccer
number,numbers
sidecar
artwork,artworks
secret,secrets
whisper,whispers,whispering
parrot,parrots
antique,antiques
shrimp,shrimps
mug,mugs
vendor,vendors
record,recording,records
bathe,bathing,bathes,bathed
arch,arches,arching,arched
column,columns
performance,performances
bedding
grove
orange,oranges
job,jobs
site,sites,siting
crucifix
weld,welds,welding,welded
melt,melting,melted,melts
pan,panning,pans
dancer,dancers
rehearse,rehearsing,rehearses
pub,pubs
sport,sports,sporting,sported
jam,jams,jammed
toast,toasting,toasted,toasts
bark,barking,barked
collection,collections
bib
wear,wearing,wore,wears,worn
microwave,microwaves
legging,leggings
edge,edged,edges
bakery
knead,kneading,kneads
machine,machines,machining
boil,boiling,boils,boiled
campfire
kettle
howl,howling
delay,delayed
waterway,waterways
platter,platters
rickshaw,rickshaws
kick,kicks,kicking,kicked
complete,completes,completing,completed
prayer,prayers
ticket,tickets
windshield
honeycomb
lift,lifts,lifting,lifted
rainstorm
category
list,listing,listed,lists
deliver,delivers,delivering,delivered
politician,politicians
speech,speeches
monitor,monitors
action,actions
harbour
know,known,knows,knew,knowing
silhouette,silhouetted,silhouettes
lapse
competition,competitions
recur,recurring
pollen
trophy,trophies
address,addresses,addressing,addressed
fashion,fashioned
stall,stalls
broccoli
sway,swaying,sways
wind,winding,winds,wound,windy
session
worship,worshiping,worshiped,worships,worshipping
enclosure,enclosures
provide,provides,providing,provided
security
nectar
urinal,urinals
onion,onions
specie,species
nut,nuts
squirrel
leader,leaders
pepper,peppers
glaze,glazed,glazing
award,awards,awarded
wheat
meeting,meetings
aisle,aisles
lid,lids
hotdog,hotdogs
mustard
footballer,footballers
hydrant
dam,dammed,dams
support,supporting,supported,supports
bunche,bunches
anime
wallpaper,wallpapers
premiere
wife,wives,bride,brides
pupil,pupils
bidet
butterfly,butterflies
blaze,blazing,blazed
function,functions
village,villages
attraction,attractions
meet,met,meets,meeting
supporter,supporters
comforter,comforters
explode,exploding,explodes
text,texts
comedian,comedians
laboratory
scientist,scientists
jetty
builder,builders
candle,candles
brow,brows
furrow,furrowed,furrows,furrowing
lemur,lemurs
desktop
issue,issues,issued
outside
horizon
spring,springs
greet,greets,greeted,greeting
launch,launching,launched,launches
colour,colours,coloured
arrow,arrows
pierce,pierced,piercing,pierces
cricketer,cricketers
wicket,wickets
handle,handles,handling
scissor,scissors
dry,dried,drying,dries
gown,gowns
astronaut,astronauts
unload,unloaded,unloading,unloads
detail,details,detailing,detailed
patrol,patrols,patrolling
steam,steamed,steaming,steams
form,forming,forms,formed
contain,containing,contains,contained
locate,located,locating
sunrise,sunrises
manager,managers
celebrity,celebrities
pollinate,pollinating,pollinated
graduation
embrace,embracing,embraces,embraced
click,clicking
remote,remotes
conference
leopard,leopards
force,forces,forced,forcing
veggie,veggies
bring,brings,bringing,brought
blow,blowing,blown,blows,blew
dessert,desserts
idea,ideas
speaker,speakers
herb,herbs
follow,following,follows,followed
summer,summers
coffere,coffered
character,characters
title,titled,titles
instal,installing,installed
organisation
quarter,quarters
plenty
concept,concepts
bun,buns
dealership
huddle
catwalk
autumn
year,years
championship,championships
sprinkle,sprinkles,sprinkled,sprinkling
bartender,bartenders
circle,circles,circling,circled
icon,icons
shadow,shadows,shadowed
state,states,stating
interest
cottage,cottages
terrace,terraced,terraces
relish
footage
depot
panel,panels,paneled,panelled
log,logs
flare,flares,flaring
deity,deities
foreground
retain,retaining,retains
joke
stair,stairs
increase,increases,increasing,increased
value,values
fog
association
isolate,isolated
mist
soul,souls
close,closed,closes,closing
tape,tapes,taping,taped
ferry,ferries
tournament,tournaments
competitor,competitors
recipe,recipes
club,clubs
piano
theme,themed
fiction
poster,posters
bean,beans
miss,missing,missed,misses
creek,creeks
dedicate,dedicated,dedicating
half,halves
winter,winters
spacecraft
incense
jack,jacks
carve,carved,carving,carves
pump,pumping,pumps,pumped
windmill,windmills
training
tag,tags,tagged
act,acts,acting
winner,winners
spire,spires
heel,heels
curl,curled,curls,curling
stuff,stuffed,stuffing,stuffs
stump,stumps
wreath,wreaths
monarch
environment,environments
organism,organisms
mission,missions
budget
wild
fabric,fabrics
waist
ripen,ripening,ripens
leaf,leafing
mosque,mosques
examine,examining,examined,examines
puck
league
sponsor,sponsored,sponsors
locomotive,locomotives
quilt,quilts
honour
diamond,diamonds
label,labeled,labels
furnish,furnished
manufacturer,manufacturers
boot,boots
host,hosting,hosted,hosts
fern,ferns
applaud,applauds,applauded,applauding
shoulder,shoulders
ray,rays
oak
pasta
rocket,rockets
devotee,devotees
offer,offering,offers,offered
pave,paves,paving
cathedral,cathedrals
pad,pads,padded
seed,seeds,seeding
wheel,wheels,wheeled
facade,facades
stone,stones
choose,chooses,chose,choosing,chosen
commander,commanders
rally,rallies,rallying
life,lives,lifes
want,wants,wanted,wanting
focus,focused,focusing
location,locations
earth
sneaker,sneakers
depict,depicts,depicting,depicted
pepperoni
flat,flats
gravy
turtle,turtles
chapel
demonstrator,demonstrators
protest,protests,protesting,protested
shout,shouts,shouting,shouted
spillway
chord,chords
strum,strums,strumming
straw
afternoon,afternoons
like,liking,liked,likes
metre,metres
weather,weathered,weathering
renovation,renovations
undergo,undergoing
world,worlds
cobble,cobbled
frost,frosted,frosting
ask,asks,asked,asking
question,questions
dresser
rotate,rotates,rotating,rotated
boardwalk
frosting
bud,buds,budding
satellite,satellites
dance,dancing,dances,danced
pineapple,pineapples
access,accessed,accessing,accesses
clinic
dentist,dentists
magnet,magnets
paper,papers
refrigerator,refrigerators
kneel,kneeling,kneels,kneeled
dolphin,dolphins
pod,pods
spider,spiders
republic
jean,jeans
centre
tuck,tucked,tucking
desert,deserts,deserted
atom,atoms
proton,protons
restroom
antelope,antelopes
shoal
wine,wines
continue,continues,continued,continuing
slogan,slogans
wilderness
mine,mines
miner,miners
ward
teddy
viaduct
receive,receives,receiving,received
treatment,treatments
atmosphere
clausura
mural,murals
author,authors
novelist
gaze,gazes,gazing
shift,shifts,shifting
driveway
barge,barges
tugboat
witch,witches
demonstrate,demonstrates,demonstrating,demonstrated
microscope,microscopes
turbine,turbines
seafood
initial,initials
local,locals
hanger
comfort,comforts,comforting
condiment,condiments
tissue,tissues
blossom,blossoms,blossoming
cherry,cherries
ruin,ruins,ruined
breeze
uproot,uprooted
switch,switching,switches,switched
energy
obtain,obtains
haul,hauled,hauling,hauls
koala,koalas
assort,assorted
position,positions,positioned
architecture
example,examples
gravel
genus
thumb,thumbs
snowflake,snowflakes
beam,beams,beaming,beamed
flavor,flavors,flavored
assortment
tusk,tusks,tusked
nest,nests,nesting
kind,kinds
case,cases
seal,seals,sealed,sealing
basil
highlight,highlighted,highlights,highlighting
celery
anthem
sing,sings,sung,sang
migrant,migrants
lily,lilies
cabbage,cabbages
bookcase,bookcases
magnify,magnifying
departure
complex
cutter
prey
mantle
phylum
electricity
crack,cracked,cracks,crackers,cracker
orchid,orchids
asphalt
root,roots,rooting,rooted
equestrian
orbit,orbiting,orbits
planet,planets
munch,munching,munches
roar,roaring
cabin,cabins
nestle,nestled
class,classes
unveil,unveiled,unveils,unveiling
degree,degrees
introduce,introduced,introduces,introducing
broomstick
gauze
scar,scars,scarred
whistle,whistles,whistling
electron,electrons
chrysalis
emerge,emerges,emerged,emerging
visitor,visitors
coal,coals
freestande,freestanding
golf,golfing
lawn,lawns
struggle,struggling,struggles,struggled
referee,referees
arena
tapestry,tapestries
tablet,tablets
dome,domes
bunny,bunnies
galaxy,galaxies
medium,media
region,regions
ivy
fridge
parade,parades,parading
butt
sniff,sniffs,sniffed,sniffing
dinosaur,dinosaurs
period
bury,burying,buries,buried
save,saved,saves,saving
jaw,jaws
attack,attacks,attacking,attacked
consider,considering,considered
texture,textures,textured
ottoman
crew,crews
date,dating,dates,dated
strand,stranded,strands
jupiter
system,systems
cauliflower
demonstration,demonstrations
beard,beards
villa,villas
volunteer,volunteers
glyph
software
wail,wailing
architect,architects
strip,strips
route,routes
commode
drain,drains,drained,draining
lichen,lichens
veteran,veterans
engrave,engraving,engraved
exhibition
exterior,exteriors
robe,robes
screenshot,screenshots
peony,peonies
certificate,certificates
ham,hams
motion
result,results,resulting
meter,meters
minute,minutes
remain,remaining,remains,remained
acre,acres
breath
bassist
deject,dejected
chain,chains,chained
padlock,padlocks
watercolor
symbol,symbols
size,sizes
motorway
volume
inspect,inspecting,inspects,inspected
cloth,cloths
iron,ironing,irons
fuel,fueling,fuels
disappear,disappearing,disappears
omelet
ritual,rituals
wrestler,wrestlers
vacuum,vacuums,vacuuming
cascade,cascades,cascading
send,sent,sending,sends
dot,dots
logo
lemon,lemons
lighting
repeat,repeating,repeated,repeats
ostrich,ostriches
election,elections
vote,votes,voting,voted
industry,industries
beef
tip,tips,tipped
product,products
glow,glowing,glows,glowed
hammock,hammocks
mom,moms
marry,married,marrying
relationship,relationships
bluebell,bluebells
woodland,woodlands
eve
frustration
leap,leaping,leaps
utensil,utensils
span,spanning,spans
oversee,oversees,overseeing,oversaw
frisbee,frisbees
balance,balances,balancing,balanced
illusion
vane
president
skydiver,skydivers
ledge,ledges
company,companies
fund,funded,funds
runner,runners
minister,ministers
harp,harps
tune,tunes
spatula,spatulas
sweep,swept,sweeps,sweeping
souvenir,souvenirs
community,communities
activist,activists
prize,prizes
escalator,escalators
shopper,shoppers
veterinarian
construct,constructed,constructing
adaptation,adaptations
adherent,adherents
pharmacist
pharmacy
finish,finishes,finishing,finished
trout
continent,continents
henna
dugout
vault,vaulted,vaults
message,messages
whip,whips,whipped,whipping
silver
compass
needle,needles
gazelle,gazelles
heard,heards
interact,interacting
journey,journeys
level,levels
bullfighter,bullfighters
clash,clashing,clashed,clashes
researcher,researchers
monastery,monasteries
knee,knees
rip,ripped,rips,ripping
cluster,clusters
storage
charm
university,universities
taxis
pontoon
headboard
tufte,tufted
skirt,skirts
twirl,twirling,twirled,twirls
dealer
element,elements
clench,clenching,clenched,clenches
fist,fists
wander,wandering,wanders
beauty
decoration,decorations
ice,icing
staff
appliance,appliances
shipyard
vow,vows
rooftop,rooftops
cheerleader,cheerleaders
snuggle,snuggled,snuggling
blade,blades
snail,snails
chalk,chalked
handwritten
gallery,galleries
belt,belts
karate
arrange,arranged,arranging,arranges
bless,blesses,blessed
cell,cells
skull,skulls
soil
hut,huts
scallop,scallops
skillet
stunt,stunts
alm,alms
nod,nods,nodding
penalty
adorn,adorned,adorning,adorns
app,apps
invention
foam
decide,deciding,decided,decides
pepperonis
roam,roaming,roams,roamed
celebration,celebrations
commuter,commuters
allow,allows,allowed,allowing
brook
smog
cruise,cruises,cruising
skip,skips,skipping,skipped
tea
mantis
hotel,hotels
fertilizer
flute,flutes
sound,sounds
rainforest,rainforests
winery
pose,posing,poses,posed
liquid,liquids
spit,spitting,spits
accent,accents,accented
mark,marks,marked,marking
spew,spewing
wildflower,wildflowers
chance,chances
radish,radishes
mattress,mattresses
puddle,puddles
stork,storks
diagram,diagrams
illustrate,illustrated,illustrating,illustrates
process,processes,processing,processed
supply,supplies,supplied
accompany,accompanied,accompanying,accompanies
violin,violins
wake,woke,waking,wakes
waterhole
globe
ambulance,ambulances
wreck,wrecked
sunshine
timber,timbers
shake,shakes,shaking,shaken,shook
bail,bailing
instructor
summit,summits
swirl,swirling,swirled,swirls
ecosystem,ecosystems
corridor
cone,cones
embassy
smother,smothered
county,counties
describe,describing,describes,described
bonnet
bobsle,bobsled,bobsledding
caravan
angle,angles
triangle,triangles
nursery,nurseries
college
bind,bound,binding
vinyl
magician
slap,slapped,slaps
champion,champions
minaret,minarets
can,cans,canned
auction
bid,bids
universe
kitten,kittens
palm,palms
cause,caused,causing,causes
cock,cocks
coleslaw
reveal,reveals,revealing,revealed
auctioneer
nothing
tuesday
fit,fits,fitted,fitting
powder,powdered
plough,ploughing,ploughs,ploughed
split,splitting,splits
palace,palaces
smash,smashing,smashed,smashes
dinner,dinners
dressing
skylight,skylights
browse,browsing,browses
florist,florists
lava
sculpture,sculptures
injury,injuries
estuary
button,buttons
fence,fencing,fenced
coral,corals
tomb,tombs
sell,sold,sells,selling
length,lengths
ram,rams
attract,attracting,attracted,attracts
banknote,banknotes
release,released,releasing,releases
stocking,stockings
relief,reliefs
completion
near,nears,nearing
scan,scans,scanned
halo
observatory
staircase,staircases
combine,combined,combines,combining
mainland
glance,glances,glancing
blur,blurred,blurring
hen,hens
religion,religions
instruct,instructs,instructing
cling,clinging,clings
concrete
peach,peaches
reading
mention,mentioned
ant,ants
avert,averts,averting,averted
occur,occurs,occurring
conflict
troop,troops
scrabble
surfer,surfers
sterle,sterling
pig,pigs
statement,statements
draw,drew,draws,drawn,drawing
movie,movies
clearing
stove
gesture,gestures,gesturing
tram,trams
mineral,minerals
spacewalk,spacewalks
scaffold,scaffolding
bass
borrow,borrowed
spool,spools
thread,threads,threading
hamster,hamsters
story,stories
tell,telling,tells,told
claim,claimed,claims,claiming
convert,converting,converted
fraction,fractions
holder
leafs
survive,survives,surviving,survived
lower,lowering,lowers,lowered
brick,bricks
spaceship
producer,producers
pilgrim,pilgrims
frog,frogs
lecturer
cupid
denmark
forage,foraging
crash,crashed,crashing,crashes
lane,lanes
labourer,labourers
bullfight
bullring
direct,directs,directing,directed
teen,teens
operation,operations
cement
content,contents
purse
shelve,shelving
unit,units
link,linking,links,linked
tangle,tangled
creator
christmas
pea,peas
wax,waxing,waxed,waxes
hairstyle,hairstyles
thin,thinning
steal,steals,stealing,stole,stolen
injection
cable,cables
stay,stayed,staying,stays
demolish,demolished,demolishes
cello
pink,pinks
uniform,uniforms
birth
brand,brands
constellation,constellations
wildfire
rent,rented
berth,berthed
final,finals
crown,crowned
thorn,thorns
sword,swords
garment,garments
crosswalk
spot,spotted,spotting,spots
husband,husbands
join,joined,joins,joining
privacy
elevator
technology,technologies
zone,zones
checker,checkered
blood
bikini,bikinis
slow,slows,slowing,slowed
glacier,glaciers
silo,silos
strike,striking,strikes,struck
beholder
treasure
male,males
stroll,strolling,strolls
singing
pack,packed,packing,packs
blink,blinks,blinking
cannon,cannons
parish
pocket,pockets
limestone
chromosome,chromosomes
actress,actresses
bicyclist,bicyclists
avoid,avoiding,avoids,avoided
performer,performers
placement
establish,establishing,established
sleeve,sleeves,sleeved
tooth,teeth
treat,treats,treating,treated
presence
sense,senses,sensing
warmth
jeep,jeeps
duck,ducks
grate,grated,grating,grates
lantern,lanterns
shear,shears,shearer
cigar
accessory,accessories
master
jogger
canopy
contestant,contestants
nail,nailed,nails
monkey,monkeys
bill,bills
everyone
expression
ecology
medicine,medicines
splay,splaying,splayed,splays
key,keys
flamingo,flamingos
tee,tees
discussion
shingle,shingles
expire,expired
bottle,bottles
culture,cultures
military
drape,draped,drapes
teenager,teenagers
lightning
development,developments
argue,argued,argues
graduate,graduates,graduated,graduating
helmet,helmets
springtime
drip,dripping
death
foil
buffalo
numeral,numerals
swamp
paratrooper,paratroopers
profession
dahlia,dahlias
paste,pasting,pasted
dragon,dragons
contrast,contrasts,contrasting,contrasted
petal,petals
jar,jars
flank,flanked
grandmother
metro
tear,torn,tears
trash
walkway,walkways
tool,tools
thanksgive,thanksgiving
qualify,qualifying,qualified
tradition,traditions
resident,residents
espresso
challenge,challenges,challenged
feeder,feeders
stoplight,stoplights
ballroom
breed,breeds,breeding,bred
preppe,prepping,prepped
crucify,crucified
hear,hearing,hears,heard
laugh,laughs,laughing,laughed
noise,noises
biker,bikers
earring,earrings
knife,knifes
grade,grading,grades
overpass
attention
drill,drills,drilling
cop,cops
hook,hooks
appeal,appeals,appealing
landmark,landmarks
prescription,prescriptions
enclose,enclosed,enclosing
racquetball
hearing
testimony
flair
azalea,azaleas
rhododendron,rhododendrons
announce,announced,announces,announcing
nominee,nominees
news
newscaster
cotton
extrude,extruded
pyramid,pyramids
lettuce
champagne
geranium,geraniums
grasp,grasps
peanut,peanuts
stalk,stalking,stalked,stalks
problem,problems
solve,solving,solves
niche
role,roles
chase,chasing,chases,chased
emit,emitting,emitted
situate,situated
candidate,candidates
rear
vacation,vacations
editorial
rink
font,fonts
typeface
dissolve,dissolving,dissolved,dissolves
nun
spirit,spirits
cinnamon
hour,hours
zookeeper,zookeepers
escort,escorting,escorted
putt,putts
rifle,rifles
pie,pies
cocoa
shield,shielding,shields
compartment,compartments
purple,purples
forearm
inspire,inspired,inspiring
week,weeks
cantilever
dollar,dollars
foliage
bedspread
trumpet,trumpets
official,officials
pumpkin,pumpkins
compare,compares,compared,comparing
ratio
macaroni
king,kings
header
loss
moped,mopeds
defend,defends,defended
lobster,lobsters
wharf
explain,explaining,explains,explained
pin,pins
height,heights
screening
headache
suffer,suffering,suffered
garbage
founder,founders
pearl,pearls
aspect,aspects
donkey,donkeys
mile,miles
mask,masks
pork
motorist,motorists
molecule,molecules
welcome,welcomes,welcomed,welcoming
mare,mares
lotus
bulldozer
hope,hoping,hopes
torch
tickle,tickled,tickles,tickling
selfie,selfies
slant,slanted
carousel
syringe
chisel,chiseling,chisels
zucchini
cupboard
equipment
textbook,textbooks
feather,feathers
ruffle,ruffled,ruffles
protestor,protestors
transform,transformed,transforming
tribute,tributes
creep,creeping
develop,developed,developing,develops
beehive
thunderstorm,thunderstorms
grasshopper
transfer,transferred,transfers
dove,doves
peace
journalist,journalists
icicle,icicles
discover,discovered,discovering
lime,limes
user,users
cleaner
sample,samples,sampled,sampling
tuxedo
project,projected,projects,projecting
red,reds
sweet,sweets
explosion,explosions
cashier,cashiers
blend,blending,blends
blender,blenders
garnish,garnished
shroud,shrouded,shrouding,shrouds
jellyfish
register
stir,stirred,stirs,stirring
beaver,beavers
gnaw,gnawed
caterpillar,caterpillars
pomegranate,pomegranates
rake,raking,rakes
crumb,crumbs
drown,drowning,drowned
greyhound,greyhounds
grain,grains
watermelon
bang,bangs,banging
jug,jugs
peacock
diploma,diplomas
million,millions
armchair
shipment
name,names,named
reproduction
envelope,envelopes
orchard
sheepdog,sheepdogs
banjo
skeleton
skydive,skydiving
asteroid
firewood
cognac
bootie,booties
engineer,engineers
admire,admires,admiring,admired
paddock
pothole,potholes
tuna
mud
good,goods
trip,trips
gnarl,gnarled
ladder,ladders
loft,lofts
province,provinces
power,powered,powering
pylon,pylons
barley
sibling,siblings
casino
poker
daisy,daisies
talon,talons
potion
own,owns,owned
property,properties
skiing
print,printed,prints
cave,caves
improve,improving,improved,improves
enlightenment
distract,distracting,distracts
clean,cleaned,cleans,cleaning
left
mast,masts
buoy
headlight,headlights
activity,activities
engage,engaged,engaging,engages
horn,horns
oyster,oysters
consist,consisting,consists,consisted
characteristic,characteristics
streak,streaked,streaks,streaking
coconut,coconuts
endanger,endangered
enrol,enrolled
rhinocero,rhinoceros
monument,monuments
fossil,fossils
answer,answers,answering
edition
history
discovery
cry,crying,cries
grapefruit
rooster,roosters
municipality,municipalities
doll,dolls
weekend,weekends
berry,berries
midfielder
jog,jogs,jogging
treadmill
badminton
gym
crucifixion
lounge,lounging,lounges
ethnicity
pallet,pallets
twig,twigs
commemoration
honeybee
salon
carrier
colleague,colleagues
jewelry
selection
marathon
navigate,navigating,navigates
rot,rotting,rotted
cuddle,cuddling
sticker,stickers
bumblebee
textile,textiles
lover,lovers
waterfront
beverage,beverages
bat,bats
recover,recovering,recovered,recovers
alley,alleys
cube,cubes
toaster
beak,beaks
judge
turkey,turkeys
destination,destinations
consume,consumed,consuming
hunt,hunted,hunting
yawn,yawns
hall,halls
bundle,bundles
ceo
assistant,assistants
drag,dragging,drags
bowtie,bowties
division,divisions
cocoon
muzzle,muzzles
information
crowbar
monday
altar
polish,polishing,polishes,polished
semifinal,semifinals
seaweed
century,centuries
delegation
hurt,hurts
archer
tracks
livingroom
crate,crates
lavender
nomad,nomads
plug,plugging,plugged
facility,facilities
suite,suites
ornament,ornaments
credit,credits
plunger,plungers
rob,robbing
submerge,submerged,submerging
offspring
scoop,scooping,scoops
maximize,maximizes,maximizing
tier,tiers
vegetation
drool
gymnast,gymnasts
dumbbell,dumbbells
exercise,exercising,exercises
bargain,bargains
cactus
elf,elves
pill,pills
crease,creased
magnification,magnifications
fiber,fibers
loom,looms
weave,weaves,woven,weaving,weaved
chip,chips,chipping,chipped
schedule,scheduled
subject
angler,anglers
crocodile,crocodiles
machinery
alight,alighting,alighted
stem,stems
fragment,fragments
lizard,lizards
kangaroo,kangaroos
cauldron
carp,carps
swimming
drone,drones
government
permit
mammal,mammals
wrestle,wrestling,wrestles
involve,involved,involving,involves
blue,blues
report,reporting,reports,reported
den
airstrip
confetti
gas,gases
snap,snapped,snapping,snaps
bet,bets
defender,defenders
scaffolding
proceed,proceeding,proceeds
checkpoint
vulture,vultures
banner,banners
participate,participating,participated,participates
sheer,sheering,sheered
birthday
narrate,narrating
feel,feels,feeling,felt
automobile
grout
hit,hits,hitting
elect,elected,electing
solution,solutions
conveyor
aeroplane,aeroplanes
maple
laborer,laborers
peer,peers,peering
program,programs
garage,garages
offering,offerings
glamour
iguana,iguanas
sunbathe,sunbathing
nave
puppy,puppies
goddess
girlfriend
figurine,figurines
grease
raspberry,raspberries
classify
pit,pits
blueprint,blueprints
bulldog
achievement,achievements
instruction,instructions
sheet,sheets
ngc
understand,understanding,understood,understands
alphabet
chest,chests
saw,sawing,sawed,saws
crosse,crosses
mate,mates,mating
advertise,advertises,advertising
soybean,soybeans
meditate,meditating
poverty
war
appetizer,appetizers
arrest,arrested
update,updating,updated
thank
agent,agents
tap,tapping,taps,tapped
palette
brain,brains
electronic,electronics
wildebeest,wildebeests
guide,guides,guided,guiding
border,borders,bordering,bordered
allegiance
oath
canyon,canyons
layout
frangipani
movement,movements
standing
accordion
charge,charging,charged
nucleus
cashew
threaten,threatening,threatens
lure
lioness
debate
fox,foxes
candy,candies
short,shorts
rib,ribs
novel
burst,bursting,bursts
whale,whales
tug,tugged,tugging,tugs
gathering
lynx
newlywed,newlyweds
qualifier,qualifiers
hazelnut
charcoal
handler,handlers
file,files,filed
tattere,tattered
siding
south
makeover
beat,beating,beats,beaten
asparagus
plum,plums
carcass
demand,demands,demanding
mangrove,mangroves
insect,insects
salute,saluting,salutes
ladybug
synchronize,synchronized
spar,sparring
digit,digits
depiction
meaning,meanings
condition,conditions
toiletry,toiletries
future
fort
cycle
prawn,prawns
relation
woode,wooded
shorn
paramedic,paramedics
rush,rushing,rushed,rushes
agency
widen,widened
jewel
residence,residences
enchant,enchanted
garland,garlands
sock,socks
timer
puppet,puppets
bricke,bricked
reporter,reporters
compete,competing,competes,competed
gorge
sardine,sardines
leprechaun
disconnect,disconnects
motherboard
stool,stools
mock
possession
exchange,exchanges,exchanged,exchanging
grenade
sip,sips,sipping
shrug,shrugging,shrugs
clamp,clamps
nipple,nipples
bandage,bandaged,bandaging
lense,lenses
wade,wades,wading
poetry
carnival
maintenance
pinata
tassel,tassels
zebras
entree
pitcher
awning
rust,rusts,rusted,rusting
mulch
gnar
shred,shredding
booth,booths
junction
bob,bobbing
purchase,purchasing,purchased,purchases
patch,patches
drug,drugs
surrounding,surroundings
series
version,versions
slay,slaying
convention
apply,applied,applying,applies
commemorate,commemorating,commemorated
victory,victories
squad
mango,mangoes,mangos
hundred,hundreds
mosquito
virus,viruses
surprise,surprised,surprises,surprising
reinforce,reinforced,reinforcing
walker,walkers
skin
crow,crows,crowing
inferno
cost,costs
remark,remarks
datum,data
animate,animated
basilica
whitewash,whitewashed
composition
hallway,hallways
stamp,stamps,stamped
thursday
batten
seashell,seashells
fell,felling,felled,fells
algae
cultivate,cultivated,cultivating,cultivates
publish,published,publishing
publisher
piste
grandchild,grandchildren
grandparent,grandparents
west
wish,wishes
robot,robots
occasion
wire,wires
memo
smoothie,smoothies
transport,transports,transported,transporting
campsite
sunday,sundays
twilight
seek,seeking,seeks
kale,kales
veg
ghat,ghats
queen
tracking
rebound
admission
headquarters
shank
cheetah,cheetahs
channel,channels,channelled
belly
sketch,sketched,sketching,sketches
math,maths
material,materials
chainsaw
embroider,embroidered
coop
farmland
cheat,cheating
source,sources
mean,meant,means
sweatshirt
copy,copying,copies
mascara
flour
opening
rank,ranked,ranking,ranks
shrine
clay
baste,basted
breach,breaching,breaches
double,doubles,doubled
thatch,thatched
import,imported
past
raccoon,raccoons
batch,batches
processor
enlarge
fringe,fringes
scarf
refugee,refugees
expand,expanded,expanding
statesman
prince
wale,wales
shall
muffin,muffins
waitress
chassis
page,pages
forecast,forecasts
pirate,pirates
railing,railings
assistance
fail,failing,failed,fails
honor,honoring,honored
roast,roasted,roasting,roasts
thanksgiving
determine,determines,determined,determining
violet
carriage,carriages
calendar
refuel,refuelling,refueling,refueled,refuelled
drift,drifting,drifts
drama
episode
heat,heats,heated,heating
marking,markings
rag
cash
count,counts,counting
handful
prism
preen,preening
opportunity,opportunities
bottom,bottoms
exasperate,exasperated
skill,skills
commentator,commentators
deal,dealing,deals,dealt
merchandise
cord,cords,corded
tight,tights
alpaca,alpacas
tack,tacked
divide,divided,dividing,divides
causeway
roadside
adventure,adventures
prescribe,prescribed
clutch,clutched,clutching,clutches
slat,slats,slatted
wii
crush,crushing,crushed,crushes
orangutan,orangutans
ridge,ridges
fear
comb,combs,combing
keeper,keepers
destroy,destroyed,destroys,destroying
calorie,calories
collapse,collapsing,collapsed
archaeologist,archaeologists
painter,painters
plastic,plastics
glove,gloves
maneuver,maneuvers
document,documents,documenting
shutter,shutters
army
pergola
cloister,cloisters
pace
lacrosse
pane,panes
nuzzle,nuzzling
caboose
blueberry,blueberries
harvesting
happen,happens,happened,happening
suburb,suburbs
daytime
fleet
zoom,zooming
trainer,trainers
gong
pat,patting,pats
impress,impressing
nap,napping
veldt
mogul,moguls
identify,identified,identifying
worshipper,worshippers
lorry,lorries
almond,almonds
dream,dreaming,dreams
corrugate,corrugated
lagoon
birch,birches
hose,hoses
rinse,rinsed,rinsing,rinses
soap,soaps
napkin,napkins
wipe,wiping,wipes
remodel,remodeled,remodeling
organize,organized,organizes,organizing
parked
press,pressing,presses,pressed
spa
language,languages
independence
parliament
preparation,preparations
scooter,scooters
politic,politics
wok
roadway
pillar,pillars
parasol
strut,strutting,struts
jackpot
extension,extensions
carat,carats
animation
template
badge,badges
eruption
cafe,cafes
pic,pics
november
pottery
rim,rims
knack,knacks
peek,peeking,peeks
casualty
simulate,simulated,simulates
campaign,campaigns
itch
scratch,scratches,scratching,scratched
workout
surrender
glider,gliders
haka
quiz
vision
diving
fairy
handbag
rollerblade,rollerblading
sapphire,sapphires
penguin,penguins
boast,boasts,boasting
risk,risks
accord,according
mandala,mandalas
finale
salesman
classmate,classmates
dishwasher
crossing
memorial
marquee
acorn,acorns
macaque,macaques
reaction,reactions
lack
assemble,assembled,assembles,assembling
encrust,encrusted
battery,batteries
narrowboat
handstand
mail
mailbox,mailboxes
kiwi,kiwis
warrior,warriors
granite
bumper
café
freeze,frozen,freezes
preserve,preserved
bulb,bulbs
dope,doping
erupt,erupting,erupts
geyser
ripple,rippling,rippled,ripples
human,humans
indicate,indicated,indicating,indicates
catapult,catapulted
headstand,headstands
mat,mats
jalapeno,jalapenos
ordain,ordains,ordained
buzz,buzzing,buzzes,buzzed
remind,reminding,reminds
district,districts
mosaic,mosaics
homestead
prairie,prairies
internet
jacuzzi
lace,laces
evolve,evolving
mustache
bead,beads,beaded
taste,tastes,tasting
partition,partitions
sofas
lord
upload,uploaded
month,months
resurface,resurfacing,resurfaced
meatloaf
regulation,regulations
require,requiring,required,requires
saturday,saturdays
bougainvillea
pavilion,pavilions
wasp
sparkle,sparkling,sparkles
passport,passports
turret,turrets
friday
swivel,swivels,swiveling
wrist,wrists
gadget,gadgets
outskirt,outskirts
mansion,mansions
topic,topics
motorcade
ancestor,ancestors
grave,graves
counterpart,counterparts
migration
chill,chilling
barbel
email,emails
rope,roping,ropes
granddaughter
drizzle,drizzling,drizzled
quarrel,quarreling
leather
hitch,hitching
untie,untying
prove,proves
ignore,ignores,ignoring
component,components
barrel,barrels
paperwork
comrade,comrades
remember,remembering,remembered
cultivation
slash,slashed
remembrance
success
snack,snacks
congratulate,congratulating,congratulated,congratulates
prevent,preventing,prevented,prevents
album
terrain
semi
umpire
lap,laps
secure,securing,secures,secured
dash,dashing
handwriting
stigma
menu
wallow,wallowing
bridegroom
topple,toppled
promenade
essay
bounce,bouncing,bounces,bounced
woodpecker
litter,littering,littered
moat
england
order,ordering,ordered,orders
rival,rivals
scoring
barbecue,barbecuing
downpour
dashboard
appetize,appetizing
preform,preforms,preforming
writing
joey
gild,gilded
god,gods
difference,differences
automate,automated
revolution
erode,eroded
fat
enhance,enhances
encourage,encourages,encouraged,encouraging
wink,winks
inhaler
trial,trials
platform,platforms
mascot,mascots
weed,weeds
halftime
hoist,hoisted,hoists
demolition
puzzle,puzzled
grin,grinning,grins
dye,dyes,dyed,dyeing
pursue,pursuing,pursued
lego,legos
marble,marbles
baker,bakers
racquet
bump,bumping
oncome,oncoming
pony,ponies
debris
accept,accepts
anemone,anemones
bracelet,bracelets
mantel
experience,experienced,experiencing,experiences
temperature,temperatures
belong,belonging,belongs
explorer
appoint,appointed
barrier,barriers
greenery
rental
refuse,refusing,refused
knock,knocked,knocks,knocking
inning
darkness
grey,greys
blast,blasting,blasts,blasted
maraca,maracas
chaos
organization
emblem
crater,craters
estate,estates
cockpit
shut,shuts,shutting
seamstress,seamstresses
altitude
carnation,carnations
bin,bins
sort,sorts,sorting,sorted
venue,venues
tiere,tiered
cadet,cadets
weight,weights,weighted
delete,deleted
tick,ticking,ticked,ticks
manage,managed,manages,managing
collar,collars
appearance,appearances
stride,strides
hatch
dig,digging,dug,digs
gymnasium
shaker,shakers
reunite,reunited,reuniting,reunites
resource,resources
renovate,renovated,renovating
swear,swears,sworn,swearing
brighten,brightening
blind,blinds
waste,wasted
stairway
heron
flea,fleas
panorama
reel,reeling,reels
chunk,chunks
refer,referred,refers
gurdwara
horror
rocker
erect,erecting,erected
snowsuit,snowsuits
citizen,citizens
zombie,zombies
trick,tricks,tricking
kabob
predator,predators
living
mum,mums
self
replica
archipelago
snake,snakes,snaking
liver
organ,organs
converge,converging
donate,donated
friendship
inspiration
buddha
hurry,hurrying,hurries
growth
diet
affection
cultivar
found,founding,founded
blog
wardrobe,wardrobes
twine
compound,compounds
relate,related,relating
kingdom
adjust,adjusting,adjusts
affect,affects,affected
hurl,hurls
trooper,troopers
weapon,weapons
segway,segways
dumpster,dumpsters
colony,colonies
soak,soaking,soaked,soaks
nursing
oval
benefit,benefits
proposal,proposals
submit,submitted
racing
partner,partners
obstacle
technique,techniques
bunk,bunks
hoop,hoops
hula
express,expressing
gardener,gardeners
starve,starving
perspective
bagel,bagels
gap,gaps
quote,quotes
promote,promoted
vaccination
crab,crabs
fact,facts
acknowledge,acknowledging,acknowledges
applause
convertible,convertibles
north
declare,declared,declares
worm
oxidize,oxidized
puffin
smiling
groom,groomed,grooms,grooming,groomsman,groomer
boulder,boulders
mountainside
wastebasket
sushi
queue,queuing,queues
disperse,dispersing,dispersed
alpha
respect,respects
quench
thirst
pressure
tourism
creature,creatures
playing
nutrient,nutrients
snowfall
dispute,disputes
bruise,bruises
pain
wince,winces
tilt,tilts,tilting
hood,hooded
straighten,straightens
controller
breathe,breathing,breathes
announcer,announcers
commentary
stroller,strollers
service,servicing,services
jut,jutting,juts
serving,servings
avocado,avocados
suv
cancel,cancelled
broadcast
amount,amounts
seize,seized,seizing
autograph,autographs
june
prophet
wetland,wetlands
roost,roosting
well,wells
shuttle
hem
dust,dusts,dusting
inauguration
rodent,rodents
marriage
education
